---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementIsCurveDrivenFilter
source: html/f7642fb9-0091-b2ab-a616-0d1b6266fd7e.htm
---
# ElementIsCurveDrivenFilter Members

Constructs a new instance of a filter to match only curve driven elements.